## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                RESOURCE                                 |
|--------|-------------------------------------------------------------------------|
| add    | `aws_rds_cluster_parameter_group.superset_db`                           |
| update | `module.superset_db.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]` |
|        | `module.superset_db.aws_rds_cluster.cluster`                            |
| delete | `aws_elasticache_cluster.superset`                                      |
|        | `aws_elasticache_subnet_group.superset`                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_elasticache_cluster.superset will be destroyed
  # (because aws_elasticache_cluster.superset is not in configuration)
  - resource "aws_elasticache_cluster" "superset" {
      - arn                        = "arn:aws:elasticache:ca-central-1:066023111852:cluster:cds-redis" -> null
      - auto_minor_version_upgrade = "true" -> null
      - availability_zone          = "ca-central-1a" -> null
      - az_mode                    = "single-az" -> null
      - cache_nodes                = [
          - {
              - address           = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
              - availability_zone = "ca-central-1a"
              - id                = "0001"
              - port              = 6379
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - cluster_id                 = "cds-redis" -> null
      - engine                     = "redis" -> null
      - engine_version             = "7.1" -> null
      - engine_version_actual      = "7.1.0" -> null
      - id                         = "cds-redis" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "sun:01:30-sun:02:30" -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t2.micro" -> null
      - num_cache_nodes            = 1 -> null
      - parameter_group_name       = "default.redis7" -> null
      - port                       = 6379 -> null
      - security_group_ids         = [
          - "sg-0e8762da76bf122d9",
        ] -> null
      - snapshot_retention_limit   = 0 -> null
      - snapshot_window            = "02:30-03:30" -> null
      - subnet_group_name          = "cds-redis-subnet-grp" -> null
      - tags                       = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all                   = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - transit_encryption_enabled = false -> null
        # (2 unchanged attributes hidden)
    }

  # aws_elasticache_subnet_group.superset will be destroyed
  # (because aws_elasticache_subnet_group.superset is not in configuration)
  - resource "aws_elasticache_subnet_group" "superset" {
      - arn         = "arn:aws:elasticache:ca-central-1:066023111852:subnetgroup:cds-redis-subnet-grp" -> null
      - description = "Managed by Terraform" -> null
      - id          = "cds-redis-subnet-grp" -> null
      - name        = "cds-redis-subnet-grp" -> null
      - subnet_ids  = [
          - "subnet-09fbcf711c8abc44c",
          - "subnet-0b910474dd8b7ce8f",
        ] -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - vpc_id      = "vpc-0010287ba1021cc5c" -> null
    }

  # aws_rds_cluster_parameter_group.superset_db will be created
  + resource "aws_rds_cluster_parameter_group" "superset_db" {
      + arn         = (known after apply)
      + description = "RDS parameter group that enables pgAudit"
      + family      = "aurora-postgresql15"
      + id          = (known after apply)
      + name        = "superset-db-pg-audit"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "pgaudit.log"
          + value        = "role,write,ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pgaudit,pg_stat_statements"
        }
    }

  # module.superset_db.aws_cloudwatch_log_group.log_exports["postgresql"] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_exports" {
        id                = "/aws/rds/cluster/superset-prod-cluster/postgresql"
        name              = "/aws/rds/cluster/superset-prod-cluster/postgresql"
      ~ retention_in_days = 7 -> 30
        tags              = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod-cluster"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.superset_db.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ db_cluster_parameter_group_name       = "default.aurora-postgresql15" -> "superset-db-pg-audit"
        id                                    = "superset-prod-cluster"
        tags                                  = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod-cluster"
            "Terraform"  = "true"
        }
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
